Revit 2027 API
RevisionNumberingSequence.SetAlphanumericRevisionSettings Method
 Replaces the current alphanumeric revision numbering settings with the provided settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAlphanumericRevisionSettings(
	AlphanumericRevisionSettings settings
)
Public Sub SetAlphanumericRevisionSettings (
	settings As AlphanumericRevisionSettings
)
public:
void SetAlphanumericRevisionSettings(
	AlphanumericRevisionSettings^ settings
)
member SetAlphanumericRevisionSettings :
        settings : AlphanumericRevisionSettings -> unit
Parameters
settings AlphanumericRevisionSettings
 The AlphanumericRevisionSettings to be applied to alphanumeric revision numbering.
Exceptions
Exception | Condition
ArgumentException |  settings is not a valid AlphanumericRevisionSettings.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace